app/controllers/posts_controller.rb

  def index
    @posts = Post.order(created_at: :desc)
---
SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('MyString', 'MyText', '2025-12-16 01:18:00.613898', '2025-12-16 01:18:00.613898')

  def destroy
    @post.destroy!
---
DELETE FROM `posts` WHERE `posts`.`id` = 980190962